# Aula 5 - Pandas [3/3] & Matplotlib

---

**Data:** 23/09/2021 \
**Prof.:** Gabriel R. Freitas

In [2]:
import pandas as pd

### Junções de tabelas

In [6]:
dic1 = {
    'A': ['foo', 'bar'],
    'B': [1, 2]
}
df1 = pd.DataFrame(dic1)

df2 = pd.DataFrame({
    'A': ['foo', 'baz'],
    'C': [3, 4]
})

In [8]:
df1

     A  B
0  foo  1
1  bar  2

In [9]:
df2

     A  C
0  foo  3
1  baz  4

##### Concat

Eixo 0 - Vertical \
Eixo 1 - Horizontal

In [22]:
import numpy as np

In [25]:
m = np.random.rand(3, 3)

In [56]:
# 0  1
# l  c
m[:, 0:1]

array([[0.5885647 ],
       [0.37735708],
       [0.46686867]])

In [61]:
concat0 = pd.concat([df1, df2], axis=0)

In [59]:
df1

     A  B
0  foo  1
1  bar  2

In [60]:
df2

     A  C
0  foo  3
1  baz  4

In [62]:
concat0

     A    B    C
0  foo  1.0  NaN
1  bar  2.0  NaN
0  foo  NaN  3.0
1  baz  NaN  4.0

In [63]:
concat1 = pd.concat([df1, df2], axis=1)

In [64]:
concat1

     A  B    A  C
0  foo  1  foo  3
1  bar  2  baz  4

In [71]:
# lista = []
lista = list()

In [102]:
for i in range(0, 4):
    df = pd.read_csv("dados/titanic.csv")
    lista.append(df)

In [80]:
tabela_inteira = pd.concat(lista, axis=0)

In [93]:
arr = np.array([30, 16, 18, 29, 20, 14])

In [94]:
arr[arr >= 18]

array([30, 18, 29, 20])

In [97]:
titanic1 = tabela_inteira[tabela_inteira.Age >= 18]

In [82]:
nome = "Montvila, Rev. Juozas"

In [101]:
tabela_inteira[tabela_inteira.Name == nome]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0,NaN,S

##### Merge

<img src="https://files.realpython.com/media/join_diagram.93e6ef63afbe.png" alt="drawing" width="400"/>

<img src="https://external-preview.redd.it/yOLzCR0qSzul2WpjQorxINB0xpU3_N9twmFVsgbGJwQ.jpg?auto=webp&s=4feedc91302ba635b3028a21b98d047def5cdc2b" alt="drawing" width="300"/>

In [105]:
df1

     A  B
0  foo  1
1  bar  2

In [106]:
df2

     A  C
0  foo  3
1  baz  4

In [110]:
df1.merge(df2, on="A", how="inner")

     A  B  C
0  foo  1  3

In [111]:
df1.merge(df2, on="A", how="left")

     A  B    C
0  foo  1  3.0
1  bar  2  NaN

In [112]:
df1.merge(df2, left_on="A", right_on="A", how="right")

     A    B  C
0  foo  1.0  3
1  baz  NaN  4

In [113]:
df1.merge(df2, left_on="A", right_on="A", how="outer")

     A    B    C
0  foo  1.0  3.0
1  bar  2.0  NaN
2  baz  NaN  4.0

---

# Matplotlib